# Манипуляция с данными

Частые задачи и операции необходимые для работы с данными для приведения к нужному виду.

In [1]:
import numpy as np
import pandas as pd

In [12]:
original_df = pd.read_csv('../data/data_example.csv')
df = original_df.copy()

## Подставить один набор данных под другой

Было

In [13]:
original_df

    day  first_group_count  second_group_count
0     1                244                 297
1     2                244                 297
2     3                244                 297
3     4                244                 297
4     5                244                 297
..  ...                ...                 ...
85   86                  0                   0
86   87                  0                   0
87   88                  0                   0
88   89                  0                   0
89   90                  0                   0

[90 rows x 3 columns]

Стало

In [14]:
df_fg = pd.DataFrame({'count': df['first_group_count'], 'day': df['day'].values, 'group': 1})
df_sg = pd.DataFrame({'count': df['second_group_count'], 'day': df['day'].values, 'group': 2})
df = pd.concat([df_fg, df_sg])
df

    count  day  group
0     244    1      1
1     244    2      1
2     244    3      1
3     244    4      1
4     244    5      1
..    ...  ...    ...
85      0   86      2
86      0   87      2
87      0   88      2
88      0   89      2
89      0   90      2

[180 rows x 3 columns]